tap "anomalyco/tap"
tap "homebrew/autoupdate"
tap "planetscale/tap"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Binary installation for rust projects
brew "cargo-binstall"
# Console Bonsai is a bonsai tree generator, written in C using ncurses
brew "cbonsai"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Console Matrix
brew "cmatrix"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Fast and simple Node.js version manager
brew "fnm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Command-line downloader for image-hosting site galleries and collections
brew "gallery-dl"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Postgres C API library
brew "libpq"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Open source relational database management system
brew "mysql"
# Open source relational database management system
brew "mysql-client"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Renders an animated, color, ANSI-text loop of the Poptart Cat
brew "nyancat"
# HTTP load generator, inspired by rakyll/hey with tui animation
brew "oha"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Object-relational database system
brew "postgresql@17"
# Python interface to Tcl/Tk
brew "python-tk@3.14"
# Cross-shell prompt for astronauts
brew "starship"
# CLI for extracting streams from various websites to a video player
brew "streamlink"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# The PlanetScale CLI
brew "planetscale/tap/pscale"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Terminal-based AI coding assistant
cask "claude-code"
# Claude code parallelisation
cask "conductor"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# Keyboard customiser
cask "karabiner-elements"
# Minecraft modding platform
cask "modrinth"
# App to write, plan, collaborate, and get organised
cask "notion"
# Open source RGB lighting control that doesn't depend on manufacturer software
cask "openrgb"
# Rhythm game
cask "osu"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Text editor for code, markup and prose
cask "sublime-text"
# Multiplayer code editor
cask "zed"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-containers"
vscode "anysphere.remote-ssh"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "cordx56.rustowl-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "jdinhlife.gruvbox"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "mvllow.rose-pine"
vscode "oven.bun-vscode"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "rust-lang.rust-analyzer"
vscode "shyykoserhiy.vscode-spotify"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tdsrmd.shadcn-ui-snippets"
vscode "typescriptteam.native-preview"
vscode "usernamehw.errorlens"
vscode "wayou.vscode-todo-highlight"
vscode "yoavbls.pretty-ts-errors"
vscode "ziglang.vscode-zig"
cargo "diesel_cli"
cargo "ttysvr"
